In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
def my_exp(x):
    return x ** 2

def my_exp_c(x, n):
    return x ** n

In [3]:
df = pd.DataFrame({
    'a' : [10, 20, 30],
    'b' : [20, 30, 40]
})

In [4]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [5]:
df.apply(my_exp)

     a     b
0  100   400
1  400   900
2  900  1600

In [6]:
df ** 2

     a     b
0  100   400
1  400   900
2  900  1600

In [7]:
df.apply(my_exp_c, n=10)

                 a                  b
0      10000000000     10240000000000
1   10240000000000    590490000000000
2  590490000000000  10485760000000000

In [9]:
printme = lambda x : print(x)

In [10]:
df.apply(printme)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [11]:
df.apply(printme, axis=1)

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [12]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [13]:
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [14]:
df['a'].apply(my_exp)

0    100
1    400
2    900
Name: a, dtype: int64

In [15]:
df['a'].apply(my_exp_c, n=10)

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [16]:
printme = lambda x : print(x)

In [17]:
df.apply(printme)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [19]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [18]:
df.apply(printme, axis=1)

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [21]:
def getmean(data, model):
    sum = 0
    for i in data:
        sum += i
    if(model == 0):
        return sum / df.shape[0]
    else:
        return sum / df.shape[1]
    
df.apply(getmean, model = 0)

a    20.0
b    30.0
dtype: float64

In [22]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [23]:
df.apply(getmean, model=1, axis=1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [24]:
import seaborn as sns

In [25]:
df = sns.load_dataset("titanic")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [26]:
def getNaN(data):
    return pd.isnull(data).sum()

df.apply(getNaN)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [27]:
def GetBalance(data):
    return (pd.isnull(data).sum()) / len(data)

df.apply(GetBalance)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [28]:
def GetBalance(data):
    return (pd.isnull(data).sum()) / data.size

df.apply(GetBalance)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [29]:
def GetBalance(data):
    return ((pd.isnull(data).sum()) / data.size) * 100

df.apply(GetBalance)

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
dtype: float64

In [30]:
isnana = lambda x : 1 - (pd.isnull(x).sum() / len(x))

In [31]:
df.apply(isnana)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [32]:
isnana = lambda x : (1 - (pd.isnull(x).sum() / len(x))) * 100
df.apply(isnana)

survived       100.000000
pclass         100.000000
sex            100.000000
age             80.134680
sibsp          100.000000
parch          100.000000
fare           100.000000
embarked        99.775533
class          100.000000
who            100.000000
adult_male     100.000000
deck            22.783389
embark_town     99.775533
alive          100.000000
alone          100.000000
dtype: float64

In [33]:
df.apply(isnana, axis=1)

0       93.333333
1      100.000000
2       93.333333
3      100.000000
4       93.333333
          ...
886     93.333333
887    100.000000
888     86.666667
889    100.000000
890     93.333333
Length: 891, dtype: float64

In [34]:
getNANCount = lambda x : pd.isnull(x).sum()

In [37]:
df['missing'] = df.apply(getNANCount, axis=1)

In [38]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,2
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,2
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,1
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,3
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,1
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2

In [39]:
import numpy as np

In [ ]:
np.ax:
    1- ()

In [41]:
def NVAU(data):
    return pd.isnull(data)

df['missing'] = df.apply(NVAU, axis=1)

ValueError: Columns must be same length as key

In [42]:
getfile = lambda x : pd.isnull(x).sum()

In [43]:
df.apply(getfile)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
missing          0
dtype: int64

In [48]:
df['missing'] = df.apply(getfile, axis=1)

In [49]:
df[['pclass', 'missing']]

     pclass  missing
0         3        1
1         1        0
2         3        1
3         1        0
4         3        1
..      ...      ...
886       2        1
887       1        0
888       3        2
889       1        0
890       3        1

[891 rows x 2 columns]

In [51]:
df[df['missing'] >= 2].sample(100)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
531,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,2
557,0,1,male,NaN,0,0,227.5250,C,First,man,True,NaN,Cherbourg,no,True,2
95,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2
612,1,3,female,NaN,1,0,15.5000,Q,Third,woman,False,NaN,Queenstown,yes,False,2
667,0,3,male,NaN,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
431,1,3,female,NaN,1,0,16.1000,S,Third,woman,False,NaN,Southampton,yes,False,2
490,0,3,male,NaN,1,0,19.9667,S,Third,man,True,NaN,Southampton,no,False,2
507,1,1,male,NaN,0,0,26.5500,S,First,man,True,NaN,Southampton,yes,True,2
613,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2
180,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False,2

In [52]:
df = pd.read_csv('../data/gapminder.tsv', sep='\t')
df.groupby("year")['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [53]:
df['year'].unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [54]:
y_1952 = df[df['year'] == 1952]['lifeExp'].mean()
y_1957 = df[df['year'] == 1957]['lifeExp'].mean()
y_1962 = df[df['year'] == 1962]['lifeExp'].mean()
y_2007 = df[df['year'] == 2007]['lifeExp'].mean()

In [55]:
df = pd.DataFrame({
    'year' : [1952, 1957, 1962, 2007],
    '' : [y_1952, y_1957, y_1962, y_2007]
})

In [56]:
df

   year
0  1952  49.057620
1  1957  51.507401
2  1962  53.609249
3  2007  67.007423

In [63]:
df.head()

   year
0  1952  49.057620
1  1957  51.507401
2  1962  53.609249
3  2007  67.007423

In [64]:
df = pd.read_csv('../data/gapminder.tsv', sep='\t')

In [65]:
def getprofile(data):
    sum = 0
    for i in data:
        sum += i
    return sum / len(data)

df.groupby("year")['lifeExp'].agg(getprofile)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [66]:
def getui(data, n):
    sum = 0
    for i in data:
        sum += i
    return (sum / len(data)) - n

df.groupby('year')['lifeExp'].agg(getui, n=df.lifeExp.mean())

year
1952   -10.416820
1957    -7.967038
1962    -5.865190
1967    -3.796150
1972    -1.827053
1977     0.095718
1982     2.058758
1987     3.738173
1992     4.685899
1997     5.540237
2002     6.220483
2007     7.532983
Name: lifeExp, dtype: float64

In [68]:
df.groupby('year')['lifeExp'].agg([np.count_nonzero, np.mean, np.std])

      count_nonzero       mean        std
year
1952            142  49.057620  12.225956
1957            142  51.507401  12.231286
1962            142  53.609249  12.097245
1967            142  55.678290  11.718858
1972            142  57.647386  11.381953
1977            142  59.570157  11.227229
1982            142  61.533197  10.770618
1987            142  63.212613  10.556285
1992            142  64.160338  11.227380
1997            142  65.014676  11.559439
2002            142  65.694923  12.279823
2007            142  67.007423  12.073021

In [69]:
df.groupby('year').agg({'lifeExp':'mean', 'pop':'median', 'gdpPercap':'median'})

        lifeExp         pop    gdpPercap
year
1952  49.057620   3943953.0  1968.528344
1957  51.507401   4282942.0  2173.220291
1962  53.609249   4686039.5  2335.439533
1967  55.678290   5170175.5  2678.334740
1972  57.647386   5877996.5  3339.129407
1977  59.570157   6404036.5  3798.609244
1982  61.533197   7007320.0  4216.228428
1987  63.212613   7774861.5  4280.300366
1992  64.160338   8688686.5  4386.085502
1997  65.014676   9735063.5  4781.825478
2002  65.694923  10372918.5  5319.804524
2007  67.007423  10517531.0  6124.371108

In [70]:
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165876
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846988
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [71]:
def my_zscore(z):
    return (z - z.mean()) / z.std()

df.groupby('year')['lifeExp'].transform(my_zscore)

0      -1.656854
1      -1.731249
2      -1.786543
3      -1.848157
4      -1.894173
          ...
1699   -0.081621
1700   -0.336974
1701   -1.574962
1702   -2.093346
1703   -1.948180
Name: lifeExp, Length: 1704, dtype: float64

In [72]:
from numpy import NAN

In [75]:
tips10 = sns.load_dataset("tips").sample(10)
tips10.loc[np.random.permutation(tips10.index)[:4], 'total_bill'] = np.NAN

In [76]:
tips10

     total_bill   tip     sex smoker   day    time  size
185       20.69  5.00    Male     No   Sun  Dinner     5
45          NaN  3.00    Male     No   Sun  Dinner     2
1           NaN  1.66    Male     No   Sun  Dinner     3
183         NaN  6.50    Male    Yes   Sun  Dinner     4
236       12.60  1.00    Male    Yes   Sat  Dinner     2
208       24.27  2.03    Male    Yes   Sat  Dinner     2
33          NaN  2.45  Female     No   Sat  Dinner     4
197       43.11  5.00  Female    Yes  Thur   Lunch     4
103       22.42  3.48  Female    Yes   Sat  Dinner     2
209       12.76  2.23  Female    Yes   Sat  Dinner     2

In [77]:
tips10.groupby('sex').count()

        total_bill  tip  smoker  day  time  size
sex
Male             3    6       6    6     6     6
Female           3    4       4    4     4     4